Repository: lhnguyens/LyftaApp
Catalog: AppTest2/*.lproj/Localizable.strings
Languages: sv

source: Push Workout
sv: Push Rutin

source: Pull Workout
sv: Pull Rutin

source: Leg Workout
sv: Ben Rutin

source: Barbell Bench Press
sv: Bänk Press

source: Dumbell Seated Shoulder Press
sv: Axelpress med hantlar

source: Weighted Dip
sv: Barr Press

source: Low-to-high Cable Flye
sv: Låg-till-hög Kabel Flyes

source: Dumbell Isolateral Skull Crusher
sv: Isolerad Tricep Press

source: Dumbell Lateral Raise
sv: Hantel Lyft åt sidan

source: Ab Wheel Rollout
sv: Maghjul

source: 1 Arm Lat Pull-in
sv: 1 Arm Lats Drag med Kabel

source: Pull-up
sv: Räckhäv

source: Pendlay Row
sv: Rådd med Skivstång

source: Machine High Row
sv: Hög Maskinrodd

source: Seated Face Pull
sv: Sittande Ansisktsdrag

source: Reverse Grip Ez Bar Curl
sv: Omvänd Curl med Ez Bar

source: Supinated Ez Bar Curl
sv: Supinerad Curl med Ez Bar

source: Dumbell Preacher Curl
sv: Hantel Preacher Curl

source: Back Squat
sv: Knä Böj

source: Deadlift
sv: Marklyft

source: Barbell Hip Thrust
sv: Skivstång Hip Thrust

source: Dumbell Walking Lunge
sv: Gåenda utfall med hantel

source: Leg Extension
sv: Ben Spark med Maskin

source: Seated Leg Curl
sv: Sittande Ben Curl Maskin

source: Standing Calf Raises
sv: Stående Vadpress
